app/controllers/groups_controller.rb

  def index
    @groups = Group.all
---
SELECT * FROM `groups`

  def show
    @group = Group.find(params[:id])
---
SELECT * FROM `groups` WHERE (`groups`.`id` = 1)

  def create
    @group = Group.new(params[:group])
    logger.info"**************************"+params[:group].inspect
    respond_to do |format|
      if @group.save
---
INSERT INTO `groups` (`group_name`, `size`, `created_at`, `updated_at`, `total`) VALUES('SAFEW', 10, '2010-04-09 08:34:12', '2010-04-09 08:34:12', 100)