app/controllers/ledger_controller.rb

 def index
      @users = User.all
      @ledgers= Ledger.all
      @groups=Group.all
---
SELECT * FROM `users`
SELECT * FROM `ledgers`
SELECT * FROM `groups`

 def show_user
      @group=Group.find(params[:group][:group_id])
---
SELECT * FROM `groups` WHERE (`groups`.`id` = 1)

def show
      @users = User.all
      @ledgers= Ledger.all
      @groups=Group.all
---
SELECT * FROM `users`
SELECT * FROM `ledgers` WHERE (created_at > NULL AND created_at < NULL)
SELECT * FROM `groups`

def show_ledger
#@group=Group.find(params[:group][:group_id])
#@users = @group.users
@ledger=Ledger.find_all_by_name(:conditions =>  ["date_ledger > ? ", params[:name]])
@users = User.all
@ledgers= Ledger.all
@groups=Group.all
---
SELECT * FROM `ledgers` WHERE (created_at > NULL ) AND (`ledgers`.`name` IS NULL) LIMIT 1
SELECT * FROM `users`
SELECT * FROM `ledgers`
SELECT * FROM `groups`

def create
         @group=Group.find(params[:group_id])
         @ledger=Ledger.all
	 @users =@group.users
	 @users.each do |user|
	    if params["#{user.id}"][:amount]
                 #@ledger = Ledger.new(params[:ledger])
	          @ledger= Ledger.new
		  @ledger.user_id = params["#{user.id}"][:user_id].to_i
                  @user = User.find(user)
                  @user.totalamount = @user.totalamount + params["#{user.id}"][:amount].to_i
 		  @ledger.amount = params["#{user.id}"][:amount].to_i
		  @ledger.name = params["#{user.id}"][:name].to_s
		  @ledger.user_name = params["#{user.id}"][:user_name].to_s
		  @ledger.group_id = params["#{@user.group_id}"][:group_id].to_i
		  @ledger.date_ledger = params["#{user.id}"][:date_ledger].to_s
                  #@ledger.date   = params["#{user.id}"]  [:date].to_i
                  #user.amount = params["#{user.id}"][:amount].to_i
		  @user.save
		  @ledger.save
---
SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
SELECT * FROM `ledgers`
SELECT * FROM `users` WHERE (`users`.group_id = 1)
SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `updated_at` = '2010-04-09 05:50:26', `totalamount` = 45 WHERE `id` = 3
INSERT INTO `ledgers` (`name`, `created_at`, `updated_at`, `amount`, `group_id`, `user_id`, `date_ledger`, `user_name`) VALUES('Sudhir', '2010-04-09 05:50:26', '2010-04-09 05:50:26', 0, 1, 1, '2010-04-09', 'sudhirsb2003')