app/controllers/refund_controller.rb

 def index
      @users = User.all
      @refunds= Refund.all
      @groups=Group.all
---
SELECT * FROM `users`
SELECT * FROM `refunds`
SELECT * FROM `groups`

 def show_user

      @refund=Refund.new
      @group=Group.find(params[:group][:group_id])
---
SELECT * FROM `groups` WHERE (`groups`.`id` = 1)

def create
         @group=Group.find(params[:group_id])
	 @users =@group.users
	 @users.each do |user|
	   if params["#{user.id}"][:amount]
	      @refund= Refund.new
		  @refund.user_id = params["#{user.id}"][:user_id].to_i
                  @user = User.find(user)
                  @user.totalamount = @user.totalamount - params["#{user.id}"][:amount].to_i
 		  @refund.amount = params["#{user.id}"][:amount].to_i
		  @refund.name = params["#{user.id}"][:name].to_s
		  @refund.user_name = params["#{user.id}"][:user_name].to_s
		  @refund.reason = params["#{user.id}"][:reason].to_s
                  @user.save
		  @refund.save
---
SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
SELECT * FROM `users` WHERE (`users`.group_id = 1)
SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `updated_at` = '2010-04-09 10:01:31', `totalamount` = 306 WHERE `id` = 2
INSERT INTO `refunds` (`name`, `created_at`, `updated_at`, `amount`, `group_id`, `user_id`, `reason`, `user_name`, `date_refund`) VALUES('Sudhir', '2010-04-09 10:01:31', '2010-04-09 10:01:31', 0, NULL, 1, '', 'saurabh', NULL)