app/controllers/users_controller.rb

INSERT INTO `users` (`address`, `occupation`, `no_of_children`, `children_school`, `reason_for_saving`, `created_at`, `history`, `updated_at`, `future_vision`, `birth_date`, `group_id`, `user_name`, `income`, `birth_place`, `age`, `status`, `image`, `totalamount`) VALUES('sdvgggdgv', 'Service', 0, 1, 'dfgdrgegerg', '2010-04-09 05:36:55', 'wefgertegewgv', '2010-04-09 05:36:55', 'wergergegvdsg', '1952-06-05', 1, 'Vijay', 235235, 'India', 25, 'UnMarried', x'69736d61696c626861692e6a7067', 0)
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save