app/controllers/userp_controller.rb

def authenticate
		@userp = Userp.new(params[:userp])
       		valid_userp = Userp.find(:first,:conditions => ["username = ? and password = ?",@userp.username, @userp.password])
---
SELECT * FROM `userps` WHERE (username = 'sudhirsb2003' and password = 'qweasdzxc') LIMIT 1

def create
    @userp = Userp.new(params[:userp])
    respond_to do |format|
      if @userp.save
---
INSERT INTO `userps` (`created_at`, `verify_password`, `updated_at`, `username`, `last_name`, `password`, `first_name`) VALUES('2010-04-09 05:30:52', 'qweasdzxc', '2010-04-09 05:30:52', 'sudhirsb2003', 'Vishwakarma', 'qweasdzxc', 'Sudhir')

def show
    @userp = Userp.find(params[:id])
---
SELECT * FROM `userps` WHERE (`userps`.`id` = 1)